<a href="https://colab.research.google.com/github/Neha-kumari31/CheatSheets/blob/master/challenge_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.

If you finish early, think about efficiency, and generalizing your solution. Hint: The concept of "triangular numbers" may come in handy.

In [0]:
list=[x ]

In [0]:
def sum():
  sum=0
  for x in range(1000):
    if x %3 ==0 or x % 5==0:
       sum = sum + x
  return sum
sum()

233168

In [0]:
import numpy as np
sum([x for x in range(1000) if (x % 3==0 or x % 5==0) ])

233168

2)As a young child, the story goes, the famous mathematician Gauss was scolded by his math teacher for not paying attention in class and was told to add up all the numbers from 1 to 100 as a punishment. He instantly answered that the sum was 5050, annoying his teacher even more. How did he know? He summed up pairs of numbers in the sequence that added to 100: `(0,100), (1,99)...(49,51) = 50 * 100 = 5000`
and added the 50 left over.

mport pandas as pd

# Data Frame to practice .loc[] techniques on
df = pd.DataFrame({'index':[1, 2, 3, 4, 5],
                   'name_1':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_2':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_3':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_4':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_5':['entry1', 'entry2', 'entry3', 'entry4', 'entry5']})

# Set Index
df.set_index('index', inplace=True)

print(df)
### Select by a Single Label
#1 Select and print the '1' Row

#2 Select and print Row 1 Label with Column 1 Label to get entry1

### Select Multiple Rows Using LISTS
#1 Select and print Row Labels 1, 2

#2 Select and print Row Labels 1, 3, 5

# Now Rows WITH desired Columns
#3 Select and print Row Labels 1, 2, 3 with Column Labels 'name_1', 'name_2', 'name_3'

#4 Select and print Row Labels 1, 3, 4, 5 with Column Labels 'name_1', 'name_3', 'name_4', 'name_5'

In [18]:
import pandas as pd
df = pd.DataFrame({'index':[1, 2, 3, 4, 5],
                   'name_1':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_2':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_3':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_4':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_5':['entry1', 'entry2', 'entry3', 'entry4', 'entry5']})
print(df)

   index  name_1  name_2  name_3  name_4  name_5
0      1  entry1  entry1  entry1  entry1  entry1
1      2  entry2  entry2  entry2  entry2  entry2
2      3  entry3  entry3  entry3  entry3  entry3
3      4  entry4  entry4  entry4  entry4  entry4
4      5  entry5  entry5  entry5  entry5  entry5

In [3]:
# Set Index
df.set_index('index',inplace=True)
df

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2  entry2
3      entry3  entry3  entry3  entry3  entry3
4      entry4  entry4  entry4  entry4  entry4
5      entry5  entry5  entry5  entry5  entry5

In [6]:
#1 Select and print the '1' Row
print(df.loc[1])

name_1    entry1
name_2    entry1
name_3    entry1
name_4    entry1
name_5    entry1
Name: 1, dtype: object

In [7]:
#2 Select and print Row 1 Label with Column 1 Label to get entry1
print(df.loc[1,'name_1'])

entry1

In [8]:
#1 Select and print Row Labels 1, 2
print(df.loc[1:2])

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2  entry2

In [19]:
list=[1,2]
print(df.loc[list])

   index  name_1  name_2  name_3  name_4  name_5
1      2  entry2  entry2  entry2  entry2  entry2
2      3  entry3  entry3  entry3  entry3  entry3

In [10]:
#Select and print Row Labels 1, 3, 5
print(df.loc[1::2])

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
3      entry3  entry3  entry3  entry3  entry3
5      entry5  entry5  entry5  entry5  entry5

In [15]:
#Select and print Row Labels 1, 2, 3 with Column Labels 'name_1', 'name_2', 'name_3'
print(df.loc[1:3,('name_1', 'name_2', 'name_3')])

       name_1  name_2  name_3
index
1      entry1  entry1  entry1
2      entry2  entry2  entry2
3      entry3  entry3  entry3

In [16]:
#4 Select and print Row Labels 1, 3, 4, 5 with Column Labels 'name_1', 'name_3', 'name_4', 'name_5'
print(df.loc[1:,('name_1', 'name_3', 'name_4', 'name_5')])

       name_1  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2
3      entry3  entry3  entry3  entry3
4      entry4  entry4  entry4  entry4
5      entry5  entry5  entry5  entry5

In [17]:
name=['name_1', 'name_3', 'name_4', 'name_5']
print(df.loc[1:,name])

       name_1  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2
3      entry3  entry3  entry3  entry3
4      entry4  entry4  entry4  entry4
5      entry5  entry5  entry5  entry5